diagram.dot
digraph CoursesDiagram {
    rankdir=TD;
    node [shape=box, style="filled",fontname="Arial"    
    ];
    edge [color="gray", penwidth=1];


    // Math courses
    node [fillcolor="#FFF2CC", color="#916f0c"];
    "20476" [label="בדידה"];
    "20474" [label="אינפי 1"];
    "20475" [label="אינפי 2"];
    "20109" [label="לינארית 1"];
    "20229" [label="לינארית 2"];
    "20425" [label="הסתברות\nסטטיסטיקה"];

    // CS courses
    node [fillcolor="#d6ddff", color="#0D32B2"];
    "20407" [label="מנמא"];
    "20905" [label="שפות תכנות"];
    "20471" [label="ארגון המחשב"];
    "20441" [label="מבוא Java"];
    "20465" [label="מעבדה בתכנות"];
    "20417" [label="אלגוריתמים"];
    "20604" [label="מודלים חישוביים"];
    "20466" [label="לוגיקה למדמח"];
    "20594" [label="מע' הפעלה"];

    // Elective courses
    node [fillcolor="#f0f0f0", color="black"];
    "20940" [label="מ' לאבטחת ה''ה"];
    "20595" [label="כריית מידע"];
    "20946" [label="מ' לבדיקות תוכנה"];
    "20296" [label="תורת הקודים"];
    "20551" [label="מ' לבינה מלאכותית"];
    "20942" [label="מ' ללמידה חישובית"];
    "20277" [label="מע' בסיסי נתונים"];
    "20582" [label="מ' לרשתות ת''מ"];
    "20944" [label="רובוטיקה\nאלגוריתמית"];
    "20554" [label="תכ' מתקדם \n Java"];
    "20462" [label="נומרית 1"];
    "20900" [label="נומרית 2"];
    "20937" [label="תכ' מע' דפנסיבי"];
    "20562" [label="גרפיקה ממוחשבת"];
    "20580" [label="מ' לקריפטוגרפיה"];
    "20906" [label="תכ' מונחה עצמים"];
    "20364" [label="קומפילציה"];
    "20574" [label="מע' נתונים"];
    "20436" [label="עק' פיתוח מע' מידע"];

    // Edges
    "20465" -> "20471";
    "20441" -> "20407";
    "20476" -> "20466";
    "20441" -> "20465";
    "20594" -> "20940";
    "20474" -> "20475" -> "20425";
    "20466" -> "20604";
    "20109" -> "20296";
    "20407" -> "20277";
    "20604" -> "20942";
    "20471" -> "20594";
    "20109" -> "20229";
    "20425" -> "20417";
    "20109" -> "20417";
    "20407" -> "20417" -> "20604";
    "20417" -> "20595";
    "20582" -> "20940";
    "20604" -> "20551";
    "20417" -> "20582";
    "20476" -> "20407";
    "20465" -> "20946";
    "20465" -> "20364";
    "20407" -> "20471";
    "20604" -> "20946";
    "20417" -> "20944";
    "20277" -> "20436";
    "20594" -> "20574";
    "20441" -> "20462";
    "20475" -> "20462";
    "20109" -> "20462";
    "20407" -> "20554";
    "20594" -> "20937";
    "20582" -> "20937";
    "20109" -> "20562";
    "20465" -> "20562";
    "20407" -> "20562";
    "20604" -> "20580";
    "20554" -> "20937";
    "20407" -> "20906";
    "20604" -> "20364";
    "20277" -> "20574";
    "20425" -> "20942";
    "20462" -> "20900";
    "20462" -> "20944";
    "20906" -> "20905";
    "20364" -> "20905";
    "20229" -> "20944";
}
